ednieuw/Arduino-ESP32-Nano-Wordclock/Old/ESP32_WordClockV180/ESP32_WordClockV180.ino
/* 
 Author      : Ed Nieuwenhuys ednieuw.nl
 Changes V001: Derived from ESP32C3S3_WordClockV026.ino
 Changes V003: Clock and SK6812 LEDstrip working
...
 Changes V094: Replaced NIMBLE with ESP32 BLE
...
 Changes V130: Removed old coding and use NEOPIXEL and use ESPAsyncWebServer. 203222 l/s again instead of 140000
 Changes V131: Added H04 tiny IR-remote
 Changes V132: Cleanup code
 Changes V133: Added in CheckRestoreWIFIconnectivity() Failsafe NoConnectionCounter that restart after 30 minutes no IP when WIFI is On 
 Changes V134: Added in CheckRestoreWIFIconnectivity() Loopcounter<10 and network available. --> Will reboot. Minor typos and cleanups
 Changes V135: Optimized used of CheckRestoreWIFIconnectivity() and check every hour instead of every mniute
 Changes V136: Added Log viewer webpage url/log 
 Changes V137: No use
 Changes V138: Solve restart ESP32 sprintf --> snprintf
 Changes V139: Logviewer -> 500 lines
 Changes V140: Changed wifi case WL_CONNECTED:
 Changes V141: Ringbuffer with String and Free heap is working OK
 Changes V142: Ringbuffer to char** 
 Changes V143: Ringbuffer to char** optimized
 Changes V144: Keeps all logs in PSRAM  Limits /tekstprint to 500 lines for safe browser display  Allows /tekstdownload for full log retrieval
 Changes V145: No log file anymore --> solved while (!Serial && ( (millis()-Tick) < 500)) { delay(50); }
 Changes V146: Works OK
 Changes V147: Line numbers removed and code cleaning in Logviewer.h 
 Changes V148: Replace snprintf(sptext, sizeof(sptext) with Tekstprintf. Added Option Y { and G from web page menu not possible
 Changes V149: Flashing warning text Option Y or G not possible in web page menu. Optimized bool GetNTPtime(bool printit) . Mem.TimeMinute used to turn off time printing every minute
               Major cleanup and bugfixes
 Changes V150: Stable version
 Changes V151: functie FILENAAM \ ook voor MacOS/Linux /.  Mem.TimeMinute       = 1;    // Print time per minute (1) or hour (2)
 Changes V152: error in 4-L clock solved. Optimized print time /min /hr
 Changes V153: Larger ringbuffer
 Changes V154: Optimizing K0 K1 K2
 Changes V155: No menu print to logging when SWversion is printed to Webpage. Added DoNotLog flag
 Changes V156: Optimize use of DoNotLog flag. const char* PrintRTCTime() --> Tekstprintln(PrintRTCTime()); WTekstprint(PrintRTCTime(), "<!--", " -->");
 Changes V157: testing
 Changes V158: K0 not updating LEDs.-->fixed. added in Everyminute() 
 Changes V159: Double printing of menu in Logging solved. Option K2 solved extra printing
 Changes V160: Stable
 Changes V161 - V173 BLEtimeSender code development 
 Changes V174: Time sender working 
 Changes V175: ToDo: Make time sender optional with Mem.TimeSender. SendMessageBLE(string -> const char* msg)
 Changes V176: deviceConnected ->  BLEConnected TSConnected
 Changes V178: Ringbuffer 
 Changes V179: Ringbuffer 
 Changes V180: Ringbuffer repaired. BLE time Sender optimized. 
 Changes V181:  

 Issue: Long menu still does not print properly in Timesender app. Will check time sender app
*********************
How to compile: 
Install ESP32 boards
Board: ESP32 core version >3.2.0 
Partition Scheme: With FAT
Pin Numbering: By Arduino pin (default)     -- > with EdsoftLED both can be used
               By GPIO number (legacy).     -- > When using NEOpixel
               Adafruit_NeoPixel/esp.c:78:(.text.espShow+0x55): undefined reference to `digitalPinToGPIONumber' when using By Arduino pin
USB mode: Normal (Tiny USB)
**********************

Select below, with only one #define selected, the clock type

*/
// =============================================================================================================================
// ------------------>   Define only one clock type
//#define FOURLANGUAGECLOCK       // Four-language clock with 625 LEDs 
#define NL144CLOCK              // Dutch display for 12 x 12 Front
//#define NL92CLOCK               // Dutch display for one LED behind every character
//#define NLM1M2M3M4L161          // NL EdSoft Qclock design
//#define DE144CLOCK              // German display for 12 x 12 Front
//#define NLM1M2M3M4L94           // NL clock with four extra LEDs for the minutes to light up 
//#define NLM1M2M3M4L114          // NL clock with four extra LEDs for the minutes to light up
//#define NLM1M2M3M4L144          // NL clock with four extra LEDs for the minutes to light up 
//#define NLM1M2M3M4L256          // NL clock with four extra LEDs for the minutes to light up

//------------------------------------------------------------------------------              //
// ESP32 Definition of installed modules
// Define the modules installed in the clock by removing the // before the #define
//--------------------------------------------
//#define ONEWIREKEYPAD3x1       // Use a 3x1 keypad with one wire
//#define ONEWIREKEYPAD3x4       // Use a 3x4 keypad with one wire

//------------------------------------------------------------------------------              //
// ESP32 Includes defines and initialisations
//-------------------------------------------
                      #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL (5, 2, 0)            // Use EdSoftLED with ESP32 compiler.
#define USEEDSOFTLED  // Use EdsoftLED >= V1.7.0 for SK6812. Saves 200-500 bytes compared with NeoPixel. NeoPixel is OK
                      #endif
                      #ifdef USEEDSOFTLED
#include <EdSoftLED.h>         // https://github.com/ednieuw/EdSoftLED for LED strip WS2812 or SK6812 
                      #else
#include <Adafruit_NeoPixel.h> // https://github.com/adafruit/Adafruit_NeoPixel  *** USE GPIO NUMBERING and compile By GPIO number (legacy) 
                      #endif
#include <Preferences.h>
#include <NimBLEDevice.h>      // For BLE communication. !!!Use NimBLE version 2.x.x  https://github.com/h2zero/NimBLE-Arduino
#include <WiFi.h>              // Used for web page 
#include <esp_sntp.h>          // for NTP
#include <esp_wps.h>           // For WPS
#include <ESPAsyncWebServer.h> // Used for webpage  https://github.com/ESP32Async 
#include <Update.h>            // For Over-the-Air (OTA)
#include <ESPmDNS.h>           // To show BLEname in router
#include <DNSServer.h>         // For the web page to enter SSID and password of the WIFI router 
#include <Wire.h>              // Ter zijner tijd Wire functies gaan gebruiken. Staan al klaar in de code 
#include <RTClib.h>            // Used for connected DS3231 RTC // Reference https://adafruit.github.io/RTClib/html/class_r_t_c___d_s3231.html
#include <Encoder.h>           // For rotary encoder
#include <Keypad.h>            // For 3x1 membrane keypad instead of rotary encoder by Mark Stanley & Alexander Brevig 
#include <IRremote.hpp>        // IR remote control

#include "ClockFaces.h"
//------------------------------------------------------------------------------              //
// SPIFFS storage
//--------------------------------------------
Preferences FLASHSTOR;

