ednieuw/Arduino-ESP32-Nano-Wordclock/Old/ESP32_WordClockV180/ESP32_WordClockV180.ino
    case 'K':  
      snprintf(sptext, sizeof(sptext), "K Test LDR, Print timestamp. K0=Off, K1=per min, K2 is per hour");
      if (len == 1)
        {                                                                                     // Test LDR
         TestLDR = 1 - TestLDR;
         snprintf(sptext, sizeof(sptext), "TestLDR: %s", TestLDR ? "On\n   Bits, Out, loops per second and time" : "Off\n");
        }
       if(InputString.equalsIgnoreCase("K0"))                                                 // do not log
        {
         Mem.TimeMinute = 0;
         snprintf(sptext, sizeof(sptext), "Time display per minute and hour is: %s", Mem.TimeMinute ? "ON\n" : "OFF\n");  
        } 
       if(InputString.equalsIgnoreCase("K1"))                                                 // Log per minute
        {
         Mem.TimeMinute = 1;
         snprintf(sptext, sizeof(sptext), "Time display per minute is: %s", Mem.TimeMinute ? "ON\n" : "OFF\n");  
        } 
       if(InputString.equalsIgnoreCase("K2"))                                                 // Log per hour
        {
         Mem.TimeMinute = 2;
         snprintf(sptext, sizeof(sptext), "Time display per hour is: %s", Mem.TimeMinute ? "ON\n" : "OFF\n");  
        }       
      break;
      
    case 'L':                                                                                 // Lower brightness
      validLength = (len > 1 && len < 5);
      if(validLength) 
       {
        Mem.LowerBrightness = (byte)SConstrainInt(InputString, 1, 0, 255);
        snprintf(sptext, sizeof(sptext), "Lower brightness: %d bits", Mem.LowerBrightness);
       } 
      else snprintf(sptext, sizeof(sptext), "**** Input fault. \nEnter Lnnn where n between 1 and 255");
      break;
      
    case 'M':                                                                                 // Max brightness
      validLength = (len > 1 && len < 5);
      if(validLength) 
       {
        Mem.UpperBrightness = SConstrainInt(InputString, 1, 1, 255);
        snprintf(sptext, sizeof(sptext), "Upper brightness changed to: %d bits", Mem.UpperBrightness);
       } 
      else snprintf(sptext, sizeof(sptext), "**** Input fault. \nEnter Mnnn where n between 1 and 255");
      break;
      
    case 'N':                                                                                 // Turn off display between hours
      snprintf(sptext, sizeof(sptext), "**** Length fault N. ****");
      if(len == 1) { Mem.TurnOffLEDsAtHH = Mem.TurnOnLEDsAtHH = 0;  } 
      else if(len == 5) 
       {
        Mem.TurnOffLEDsAtHH = (byte)InputString.substring(1, 3).toInt();
        Mem.TurnOnLEDsAtHH  = (byte)InputString.substring(3, 5).toInt();
       }
      Mem.TurnOffLEDsAtHH = _min(Mem.TurnOffLEDsAtHH, 23);
      Mem.TurnOnLEDsAtHH  = _min(Mem.TurnOnLEDsAtHH, 23);
      snprintf(sptext, sizeof(sptext), "Display is OFF between %2d:00 and %2d:00", Mem.TurnOffLEDsAtHH, Mem.TurnOnLEDsAtHH);
      break;
      
    case 'O':                                                                                 // Turn On/Off Display
      if(len == 1) 
       {
        LEDsAreOff = !LEDsAreOff;
        snprintf(sptext, sizeof(sptext), "Display is %s", LEDsAreOff ? "OFF" : "ON");
        if(LEDsAreOff) { ClearScreen(); }
        else 
         {
          Tekstprintln(sptext);
          lastminute = 99;                                                                    // Force display update
          sptext[0]=0;                                                                        // Suppress a second print of sptext
         }
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault O. ****");
      break;
      
    case 'P':                                                                                 // Status LEDs On/Off
      if(len == 1) {
        Mem.StatusLEDOn = !Mem.StatusLEDOn;
        UpdateStatusLEDs(0);
        snprintf(sptext, sizeof(sptext), "StatusLEDs are %s", Mem.StatusLEDOn ? "ON" : "OFF");
      } else snprintf(sptext, sizeof(sptext), "**** Length fault P. ****");
      break;
      
    case 'Q':                                                                                 // Display choice
      if(len == 1)                                                                            // Print display options menu   
       {
        Tekstprintln("  Q0= Default yellow colour");
        Tekstprintln("  Q1= Hourly colour");
        Tekstprintln("  Q2= All white");
        Tekstprintln("  Q3= All Own colour");
        Tekstprintln("  Q4= Own colour, HETISWAS changing");
        Tekstprintln("  Q5= Wheel colour");
        Tekstprintln("  Q6= Digital display");
        Tekstprintln("  Q7= Hourly colour, HETISWAS changing");        
        Tekstprintln("  Q8= Rainbow colour");
        if (Mem.RandomDisplay) Tekstprintln("Random Display changing in ON\nChoose a display to stop it");
        Tekstprintln("In menu: ~1 or ~ is changing per minute, ~2 changing per hour.");
        sptext[0] = 0;                                                                        // Suppress a second print of sptext
       } 
      else 
      {
       byte dp = (byte)InputString.substring(1, 2).toInt();
       if(dp>LASTITEM) dp=0;
       Mem.DisplayChoice = dp;
       PrintDisplayChoice(); 
       sptext[0] = 0;                                                                         // Suppress a second print of sptext
       Mem.RandomDisplay = 0;                                                                 // turn Off random changing display
      }
      lastminute = 99;                                                                        // Force a minute update
      break;
      
    case 'R':                                                                                 // Reset to default settings
      if(InputString.equals("RRRRR"))                                                         // Delete WIFI settings and set defaults
      {
        Reset();
        ResetCredentials();
        ESP.restart();
        break;
      }
      if(InputString.equals("RRR"))                                                           // Delete WIFI settings only
       { 
        ResetCredentials();
        snprintf(sptext, sizeof(sptext), "\nSSID and password deleted. \nWIFI, NTP and BLE is On\n Enter @ to restart");
        break;
       }
      if(len == 1)                                                                            // Set to default settings
        {
        Reset();
        snprintf(sptext, sizeof(sptext), "\nReset to default values: Done");
        lastminute = 99;                                                                      // Force a minute update
        Displaytime(); Tekstprintln("");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault R. ****");
      break;
      
