ednieuw/Arduino-ESP32-Nano-Wordclock/Old/ESP32_WordClockV180/ESP32_WordClockV180.ino
if (Mem.UseRotary == 4)                                                                       // {"MIN-1", "MIN+1","UUR-1","UUR+1","POWER","ONOFF"};
 {
 if (IR_PowerOnstate == false) // && ButtonNamesNr < 14 ) 
 {
 switch(ButtonNamesNr)
    {
    case 4:                                                                                   // Button "POWER"
            ToggleIRpower();
            break;
    case 5:                                                                                   // Button "ONOFF"
            ReworkInputString("O");                                                           // Turn On OFF display
            break;
    default:
            Tekstprintln("Turn On remote with POWER");
            break;
    }
  }
 else
   {
    switch(ButtonNamesNr)
     {
    case 0:                                                                                   // Button "MIN-1"
            AdjustTime(0, -1, 0);                                                             // -1 minute
            break;
    case 1:                                                                                   // Button "MIN+1"
            AdjustTime(0, 1, 0);                                                              // +1 minute
            break;
    case 2:                                                                                   // Button "UUR-1"
            AdjustTime(-1, 0, 0);                                                             // -1 hour
            break;
    case 3:                                                                                   // Button "UUR+1"
            AdjustTime(1, 0, 0);                                                              // +1 hour
            break;
    case 4:                                                                                   // Button "POWER"
            ToggleIRpower();
            break;
    case 5:                                                                                   // Button "ONOFF"
            ReworkInputString("O");                                                           // Turn On OFF display
            break;
    default:
            snprintf(sptext, sizeof(sptext), "Button '%s' not yet assigned", ButtonName.c_str());
            Tekstprintln(sptext);
            break;
      }
   }
 } // end if ==4
}

//--------------------------------------------                                                //
// IR-RECEIVER Adjust current time by hours/minutes/seconds
//--------------------------------------------
void AdjustTime(int DeltaHours, int DeltaMinutes, int DeltaSeconds)
{
 timeinfo.tm_hour += DeltaHours;
 timeinfo.tm_min  += DeltaMinutes;
 timeinfo.tm_sec  += DeltaSeconds;
 //time_t t = 
 mktime(&timeinfo);
 if(DS3231Installed)   SetDS3231Time();
 Displaytime();  Tekstprintln("");     
}

//--------------------------------------------                                                //
// IR-RECEIVER Turn On or off Remote control
// Turns off after 60 seconds
//--------------------------------------------
void ToggleIRpower(void)
{
 static bool powerState = false;                                                              //
 powerState = !powerState;
 if (powerState)
  {
   IR_PowerOnstate = true;                                                                    // React on IR-remote input
   Tekstprintln("IR-remote is ON");
   IR_StartTime = millis();
  }
 else
  {
    Tekstprintln("IR-remote is OFF");
    IR_PowerOnstate = false;                                                                  // Do not react on IR-remote input
  } 
}

//   Ringbuffer
//--------------------------------------------                                                //
// LOGBUFFER Initialize circular logging buffer      
//--------------------------------------------
void InitLogBuffer()
{
 size_t largest = 100000; //heap_caps_get_largest_free_block(MALLOC_CAP_8BIT);
 size_t reserve = 80000; 
 StoredStartHeaps(true);                                                                      // Store the values before allocation                                                                               //                                     // Keep a safety margin tune this based on your system
 if (largest > reserve)        LogBufferSize = largest - reserve;
 else        LogBufferSize = largest / 2;
 LogBuffer = (char*)heap_caps_malloc(LogBufferSize, MALLOC_CAP_8BIT);
 if (!LogBuffer) { Tekstprintln("ERROR: Could not allocate log buffer"); return; }
 memset(LogBuffer, 0, LogBufferSize);
 LogWritePos = 0;
 LogWrapped  = false;
 snprintf(sptext, sizeof(sptext)," Log buffer allocated: %u bytes (largest block was %u)",
             (unsigned)LogBufferSize, (unsigned)largest);
 Tekstprintln(sptext);
}

//--------------------------------------------                                                //
// LOGBUFFER Add a log line (raw C-string). Always ends with '\n'.
//--------------------------------------------
void AddLog(const char* msg)
{
 if (DoNotLog)   return; 
 if (!LogBuffer) return;
 static size_t Logbufferlength = 0; 
 size_t len = strlen(msg);
 if (len >= LogBufferSize)
    {
     msg += (len - LogBufferSize);                                                             // keep only last part
     len = strlen(msg);
    }
 for (size_t i = 0; i < len; i++)
    {
     LogBuffer[LogWritePos++] = msg[i];
     if (LogWritePos >= LogBufferSize)                                                        // if we are at the end then wrap
        {
         LogWritePos = 0;
         LogWrapped  = true;                                                                  // Essential to find the last 500 lines
        }
    }

// Debugging
  // if (LogBufferSize > Logbufferlength)   Logbufferlength += len; 
  // else LogBufferSize = Logbufferlength; 
  // Serial.print("  Logbufferlength: "); Serial.print(Logbufferlength);
  // Serial.print("  Remaining: "); Serial.println(LogBufferSize - Logbufferlength); 
}

void HandleTekstPrint(AsyncWebServerRequest *request)
{
 if (!LogBuffer){ request->send(200, "text/plain", "Log buffer uninitialized\n"); return; }
 AsyncResponseStream *response = request->beginResponseStream("text/plain");
 
 // Find the actual end of the last complete line (last \n before LogWritePos)
 ssize_t lastNewline = -1;
 ssize_t searchPos = (LogWritePos == 0) ? LogBufferSize - 1 : LogWritePos - 1;
 
