ednieuw/Arduino-ESP32-Nano-Wordclock/Old/ESP32_WordClockV180/ESP32_WordClockV180.ino
 for (size_t i = 0; i < LogBufferSize; i++)
    {
     if (LogBuffer[searchPos] == '\n') 
        {
         lastNewline = searchPos;
         break;
        }
     if (!LogWrapped && searchPos == 0) break;
     searchPos = (searchPos == 0) ? LogBufferSize - 1 : searchPos - 1;
    }
 
 if (lastNewline == -1)  // No complete lines yet
    {
     request->send(200, "text/plain", "No complete lines in buffer\n");
     return;
    }
 
 // Now count back 500 lines from lastNewline
 size_t lineCount = 0;
 ssize_t pos = lastNewline;
 
 for (size_t scanned = 0; scanned < LogBufferSize && lineCount < 499; scanned++)  // 499 because we already found one \n
    {
     pos = (pos == 0) ? LogBufferSize - 1 : pos - 1;
     if (LogBuffer[pos] == '\n') lineCount++;
     if (!LogWrapped && pos == 0) break;
    }
 
 // Start is the position right after the newline we stopped at
 size_t start = (pos + 1) % LogBufferSize;
 size_t end = (lastNewline + 1) % LogBufferSize;  // Include the last newline
 
 if (!LogWrapped || start <= end)
   {
    response->write(LogBuffer + start, end - start);
   }
 else
   {
    response->write(LogBuffer + start, LogBufferSize - start);
    response->write(LogBuffer, end);
   }
 request->send(response);
}
// //--------------------------------------------                                                //
// // LOGBUFFER Stream the last 500 lines circular log buffer directly to the client
// //--------------------------------------------
// void HandleTekstPrint(AsyncWebServerRequest *request)
// {
//  if (!LogBuffer){ request->send(200, "text/plain", "Log buffer uninitialized\n"); return; }
//  AsyncResponseStream *response = request->beginResponseStream("text/plain");
//  size_t lineCount = 0;
//  ssize_t pos = LogWritePos;
//  for (size_t scanned = 0; scanned < LogBufferSize && lineCount < 500; scanned++)              // Count lines backwards to find last 500 '\n's
//     {
//      pos = (pos == 0) ? LogBufferSize - 1 : pos - 1;
//      if (LogBuffer[pos] == '\n') lineCount++;
//      if (!LogWrapped && pos == 0) break;                                                      // Stop if buffer not wrapped
//     }
//    size_t start = (pos + 1) % LogBufferSize;                                                  // Now pos points to the start of the 500th-last line (or beginning)
//  if (!LogWrapped || start < LogWritePos)                                                      // Stream lines from start → end of buffer
//    {
//     response->write(LogBuffer + start, LogWritePos - start);
//    }
//  else
//    {
//     response->write(LogBuffer + start, LogBufferSize - start);                                // Wrap: first part from start → end of buffer
//     response->write(LogBuffer, LogWritePos);                                                  // second part from 0 → write pos
//    }
//  request->send(response);
// }

//--------------------------------------------                                                //
// LOGBUFFER Stream all the circular log buffer directly to the client
//--------------------------------------------
void HandleTekstDownload(AsyncWebServerRequest *request)
{
 if (!LogBuffer) {request->send(200, "text/plain", "Log buffer uninitialized\n"); return; }
 AsyncResponseStream *response = request->beginResponseStream("text/plain");
 if (!LogWrapped) response->write(LogBuffer, LogWritePos);                                    // Buffer hasn't wrapped yet - just write from start to current position
 else                                                                                         // Buffer has wrapped - find the oldest complete line
   {
    ssize_t pos = LogWritePos;                                                                // Start from LogWritePos and scan forward to find first complete line
    while (pos < (ssize_t)LogBufferSize && LogBuffer[pos] != '\n')   pos++;                   // Scan forward to find the first '\n' (end of partial line)
    if (pos < (ssize_t)LogBufferSize) pos++;                                                  // Move past the '\n' to start of next complete line
    if (pos >= (ssize_t)LogBufferSize) pos = 0;                                               // If we've gone past the end, wrap to beginning
    size_t start = pos;
    if (start < LogWritePos) response->write(LogBuffer + start, LogWritePos - start);         // Data doesn't wrap                                                      // Now stream from start position (oldest complete line)
    else                                                                                      // Data wraps around - write in two parts
      {
       size_t tail = LogBufferSize - start;
       response->write(LogBuffer + start, tail);                                              // First part: start → end of buffer
       response->write(LogBuffer, LogWritePos);                                               // Second part: 0 → write position
      }
   }
 request->send(response);
}
/// ringbuffer
